app/controllers/tamanhos_controller.rb

  def index
    @tamanhos = Tamanho.all
---
SELECT "tamanhos".* FROM "tamanhos"